IDEA StatiCa Open Model
CssComponent.Geometry Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Geometry
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Region2D Geometry { get; set; }
Public Property Geometry As Region2D
	Get
	Set
public:
property Region2D^ Geometry {
	Region2D^ get ();
	void set (Region2D^ value);
}
Property Value
Type: Region2D
See Also
Reference
CssComponent Class
IdeaRS.OpenModel.CrossSection Namespace